In [ ]:
import pandas as pd

In [ ]:
s = pd.Series([10,20,30],index=["a","b","c"])

In [ ]:
s

In [ ]:
data = {
    "Name":["Alice","Bob"],
    "Age":[25,23]
}

df = pd.DataFrame(data=data)

In [ ]:
df

In [ ]:
df.to_csv("data.csv", index=False)

In [ ]:
df2 = pd.read_csv("data.csv")

In [ ]:
df2

In [ ]:
df.head(1)

In [ ]:
df.tail(1)

In [ ]:
df.info()

In [ ]:
df.describe()

#### dataframe Operations

In [ ]:
df[df['Age']>23]

index with location

In [ ]:
df.iloc[0]

In [ ]:
df.loc[0]

In [ ]:
df.loc[:, "Name"]

In [ ]:
import seaborn as sns
iris = sns.load_dataset('iris')
df = pd.DataFrame(iris)

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.info(
)

In [ ]:
df.describe()

In [ ]:
selected_col = df[["species","sepal_length"]]

In [ ]:
selected_col.head()

In [ ]:
filtered_rows = df[(df["sepal_length"]>5.)&(df["species"]=="setosa")]

In [ ]:
filtered_rows.head()

In [ ]:
df2 = pd.DataFrame()

In [ ]:
df2["column_name"] = 0

In [ ]:
df2["column_name"] = df2["column_name"].fillna(0)

In [ ]:
df2.fillna(method="ffill")

In [ ]:
df2.fillna(method="bfill")

In [ ]:
df2["column_name"] = df2["column_name"].interpolate()

In [ ]:
df2

In [ ]:
df2 = df2.rename(columns={
    "column_name":"new_name"
})

In [ ]:
df2["new_name"] = df2["new_name"].astype("float")

In [74]:
df2["new_name"] = pd.to_datetime(df["new_name"])

KeyError: 'new_name'

In [80]:
df2["new_name"] = [1,2,3]

In [81]:
df2["new_name"] = df2["new_name"]*2

In [82]:
df2["new_name"]

0    2
1    4
2    6
Name: new_name, dtype: int64

In [83]:
combined = pd.concat([df, df2], axis=0)

In [ ]:
merged = pd.merge(df,df2,on=NULL)

Left JOIN

In [ ]:
merged = pd.merge(df,df2,how="left", on="common_col")

INNER JOIN

In [ ]:
merged = pd.merge(df,df2,how="inner", on="common_col")

JOINED

In [ ]:
joined = df.join(df2, how="inner")

In [84]:
import numpy as np

In [85]:
data = {
    "Names": ["Alice", "Bob", np.nan, "David" ],
    "Age":[25,np.nan,30,35],
    "Score":[85,90,np.nan,88]
}

df = pd.DataFrame(data)

In [86]:
df

   Names   Age  Score
0  Alice  25.0   85.0
1    Bob   NaN   90.0
2    NaN  30.0    NaN
3  David  35.0   88.0

In [87]:
df["Age"] = df["Age"].fillna(df["Age"].mean())

In [88]:
df

   Names   Age  Score
0  Alice  25.0   85.0
1    Bob  30.0   90.0
2    NaN  30.0    NaN
3  David  35.0   88.0

In [89]:
df["Score"] = df["Score"].interpolate()

In [90]:
df

   Names   Age  Score
0  Alice  25.0   85.0
1    Bob  30.0   90.0
2    NaN  30.0   89.0
3  David  35.0   88.0

In [93]:
df = df.rename(columns={"Names":"Student_Name",
                        "Score":"Exam_Score"})

In [94]:
df

  Student_Name   Age  Exam_Score
0        Alice  25.0        85.0
1          Bob  30.0        90.0
2          NaN  30.0        89.0
3        David  35.0        88.0

In [98]:
df1 = pd.DataFrame({
    "ID":[1,2,3],
    "Name" : ["Alice", "Bob", "Charlie"],
    "Age": [25,30,35]
})
df2 = pd.DataFrame({
    "ID":[1,2,3],
    "Name" : ["Alice", "Bob", "Charlie"],
    "Scores": [85,90,88]
})

In [99]:
df1

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35

In [100]:
df2

   ID     Name  Scores
0   1    Alice      85
1   2      Bob      90
2   3  Charlie      88

In [101]:
merged = pd.merge(df1,df2,how="inner",on="ID")

In [102]:
merged

   ID   Name_x  Age   Name_y  Scores
0   1    Alice   25    Alice      85
1   2      Bob   30      Bob      90
2   3  Charlie   35  Charlie      88

In [105]:
merged["Score_percentage"]= (merged["Scores"]/200)*100

In [106]:
merged

   ID   Name_x  Age   Name_y  Scores  Score_percentage
0   1    Alice   25    Alice      85              42.5
1   2      Bob   30      Bob      90              45.0
2   3  Charlie   35  Charlie      88              44.0

#### Grouped

In [119]:
data = { 
    "Class":["A","B","A","B","C","C"],
    "Score":[85,90,88,72,95,80],
    "Age":[15,16,15,17,16,15]
    }

In [120]:
df = pd.DataFrame(data)

In [121]:
grouped = df.groupby("Class").mean()

In [122]:
grouped

       Score   Age
Class
A       86.5  15.0
B       81.0  16.5
C       87.5  15.5

In [123]:
stats = df.groupby("Class").aggregate(
{
    "Score":["mean","max","min"],
    "Age":["mean","max","min"]}
)

In [124]:
stats

      Score           Age
       mean max min  mean max min
Class
A      86.5  88  85  15.0  15  15
B      81.0  90  72  16.5  17  16
C      87.5  95  80  15.5  16  15